apache/nuttx/arch/arm/src/samd5e5/chip/samd5e5_pinmap.h
/********************************************************************************************
 * arch/arm/src/samd5e5/chip/samd5e5_pinmap.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAMD5E5_CHIP_SAM_PINMAP_H
#define __ARCH_ARM_SRC_SAMD5E5_CHIP_SAM_PINMAP_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/
/* GPIO pin definitions *********************************************************************/
/* Alternate Pin Functions.
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2, etc.
 * Drivers, however, will use the pin selection without the numeric suffix.
 * Additional definitions are required in the board.h file.  For example, if we
 * wanted the SERCOM0 PAD0 on PA8, then the following definition should appear in
 * the board.h header file for that board:
 *
 * #define PORT_SERCOM0_PAD0 PORT_SERCOM0_PAD0_1
 *
 * The driver will then automatically configure PA8 as the SERCOM0 PAD0 pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in this file.
 */

/* Analog comparator (AC) */

#define PORT_AC_AIN0                 (PORT_FUNCB | PORTA | PORT_PIN4)
#define PORT_AC_AIN1                 (PORT_FUNCB | PORTA | PORT_PIN5)
#define PORT_AC_AIN2                 (PORT_FUNCB | PORTA | PORT_PIN6)
#define PORT_AC_AIN3                 (PORT_FUNCB | PORTA | PORT_PIN7)
#define PORT_AC_CMP0_1               (PORT_FUNCM | PORTA | PORT_PIN12)
#define PORT_AC_CMP0_2               (PORT_FUNCM | PORTA | PORT_PIN18)
#define PORT_AC_CMP0_3               (PORT_FUNCM | PORTB | PORT_PIN24)
#define PORT_AC_CMP1_1               (PORT_FUNCM | PORTA | PORT_PIN13)
#define PORT_AC_CMP1_2               (PORT_FUNCM | PORTA | PORT_PIN19)
#define PORT_AC_CMP1_3               (PORT_FUNCM | PORTB | PORT_PIN25)

/* Analog-to-Digital Conversion (ADC) */

#define PORT_ADC0_AIN0               (PORT_FUNCB | PORTA | PORT_PIN2)
#define PORT_ADC0_AIN1               (PORT_FUNCB | PORTA | PORT_PIN3)
#define PORT_ADC0_AIN2               (PORT_FUNCB | PORTB | PORT_PIN8)
#define PORT_ADC0_AIN3               (PORT_FUNCB | PORTB | PORT_PIN9)
#define PORT_ADC0_AIN4               (PORT_FUNCB | PORTA | PORT_PIN4)
#define PORT_ADC0_AIN5               (PORT_FUNCB | PORTA | PORT_PIN5)
#define PORT_ADC0_AIN6               (PORT_FUNCB | PORTA | PORT_PIN6)
#define PORT_ADC0_AIN7               (PORT_FUNCB | PORTA | PORT_PIN7)
#define PORT_ADC0_AIN8               (PORT_FUNCB | PORTA | PORT_PIN8)
#define PORT_ADC0_AIN9               (PORT_FUNCB | PORTA | PORT_PIN9)
#define PORT_ADC0_AIN10              (PORT_FUNCB | PORTA | PORT_PIN10)
#define PORT_ADC0_AIN11              (PORT_FUNCB | PORTA | PORT_PIN11)
#define PORT_ADC0_AIN12              (PORT_FUNCB | PORTB | PORT_PIN0)
#define PORT_ADC0_AIN13              (PORT_FUNCB | PORTB | PORT_PIN1)
#define PORT_ADC0_AIN14              (PORT_FUNCB | PORTB | PORT_PIN2)
#define PORT_ADC0_AIN15              (PORT_FUNCB | PORTB | PORT_PIN3)

#define PORT_ADC1_AIN0               (PORT_FUNCB | PORTB | PORT_PIN8)
#define PORT_ADC1_AIN1               (PORT_FUNCB | PORTB | PORT_PIN9)
#define PORT_ADC1_AIN2               (PORT_FUNCB | PORTA | PORT_PIN8)
#define PORT_ADC1_AIN3               (PORT_FUNCB | PORTA | PORT_PIN9)
#define PORT_ADC1_AIN4               (PORT_FUNCB | PORTC | PORT_PIN2)
#define PORT_ADC1_AIN5               (PORT_FUNCB | PORTC | PORT_PIN3)
#define PORT_ADC1_AIN6               (PORT_FUNCB | PORTB | PORT_PIN4)
#define PORT_ADC1_AIN7               (PORT_FUNCB | PORTB | PORT_PIN5)
#define PORT_ADC1_AIN8               (PORT_FUNCB | PORTB | PORT_PIN6)
#define PORT_ADC1_AIN9               (PORT_FUNCB | PORTB | PORT_PIN7)
#define PORT_ADC1_AIN10              (PORT_FUNCB | PORTC | PORT_PIN0)
#define PORT_ADC1_AIN11              (PORT_FUNCB | PORTC | PORT_PIN1)
#define PORT_ADC1_AIN12              (PORT_FUNCB | PORTC | PORT_PIN30)
#define PORT_ADC1_AIN13              (PORT_FUNCB | PORTC | PORT_PIN31)
#define PORT_ADC1_AIN14              (PORT_FUNCB | PORTD | PORT_PIN0)
#define PORT_ADC1_AIN15              (PORT_FUNCB | PORTD | PORT_PIN1)

/* Analog Voltage Reference (ANAREF) */

