apache/nuttx/arch/arm/src/samd5e5/chip/samd5e5_pinmap.h
#define PORT_ANAREF_VREFA            (PORT_FUNCB | PORTA | PORT_PIN3)
#define PORT_ANAREF_VREFB            (PORT_FUNCB | PORTA | PORT_PIN4)
#define PORT_ANAREF_VREFC            (PORT_FUNCB | PORTA | PORT_PIN6)

/* Controller Area Network (CAN) */

#define PORT_CAN0_RX_1               (PORT_FUNCI | PORTA | PORT_PIN23)
#define PORT_CAN0_RX_2               (PORT_FUNCI | PORTA | PORT_PIN25)
#define PORT_CAN0_TX_1               (PORT_FUNCI | PORTA | PORT_PIN22)
#define PORT_CAN0_TX_2               (PORT_FUNCI | PORTA | PORT_PIN24)

#define PORT_CAN1_RX_1               (PORT_FUNCH | PORTB | PORT_PIN13)
#define PORT_CAN1_RX_2               (PORT_FUNCH | PORTB | PORT_PIN15)
#define PORT_CAN1_TX_1               (PORT_FUNCH | PORTB | PORT_PIN12)
#define PORT_CAN1_TX_2               (PORT_FUNCH | PORTB | PORT_PIN14)

/*  Configurable Custom Logic (CCL) */

#define PORT_CCL_IN0_1               (PORT_FUNCN | PORTA | PORT_PIN16)
#define PORT_CCL_IN0_2               (PORT_FUNCN | PORTA | PORT_PIN4)
#define PORT_CCL_IN0_3               (PORT_FUNCN | PORTB | PORT_PIN22)
#define PORT_CCL_IN1_1               (PORT_FUNCN | PORTA | PORT_PIN17)
#define PORT_CCL_IN1_2               (PORT_FUNCN | PORTA | PORT_PIN5)
#define PORT_CCL_IN1_3               (PORT_FUNCN | PORTB | PORT_PIN0)
#define PORT_CCL_IN2_1               (PORT_FUNCN | PORTA | PORT_PIN18)
#define PORT_CCL_IN2_2               (PORT_FUNCN | PORTA | PORT_PIN6)
#define PORT_CCL_IN2_3               (PORT_FUNCN | PORTB | PORT_PIN1)
#define PORT_CCL_IN3_1               (PORT_FUNCN | PORTA | PORT_PIN30)
#define PORT_CCL_IN3_2               (PORT_FUNCN | PORTA | PORT_PIN8)
#define PORT_CCL_IN4_1               (PORT_FUNCN | PORTA | PORT_PIN9)
#define PORT_CCL_IN4_2               (PORT_FUNCN | PORTC | PORT_PIN27)
#define PORT_CCL_IN5_1               (PORT_FUNCN | PORTA | PORT_PIN10)
#define PORT_CCL_IN5_2               (PORT_FUNCN | PORTC | PORT_PIN28)
#define PORT_CCL_IN6_1               (PORT_FUNCN | PORTA | PORT_PIN22)
#define PORT_CCL_IN6_2               (PORT_FUNCN | PORTB | PORT_PIN6)
#define PORT_CCL_IN7_1               (PORT_FUNCN | PORTA | PORT_PIN23)
#define PORT_CCL_IN7_2               (PORT_FUNCN | PORTB | PORT_PIN7)
#define PORT_CCL_IN8_1               (PORT_FUNCN | PORTA | PORT_PIN24)
#define PORT_CCL_IN8_2               (PORT_FUNCN | PORTB | PORT_PIN8)
#define PORT_CCL_IN9_1               (PORT_FUNCN | PORTB | PORT_PIN14)
#define PORT_CCL_IN9_2               (PORT_FUNCN | PORTC | PORT_PIN20)
#define PORT_CCL_IN10_1              (PORT_FUNCN | PORTB | PORT_PIN15)
#define PORT_CCL_IN10_2              (PORT_FUNCN | PORTC | PORT_PIN21)
#define PORT_CCL_IN11_1              (PORT_FUNCN | PORTB | PORT_PIN10)
#define PORT_CCL_IN11_2              (PORT_FUNCN | PORTB | PORT_PIN16)
#define PORT_CCL_OUT0_1              (PORT_FUNCN | PORTA | PORT_PIN19)
#define PORT_CCL_OUT0_2              (PORT_FUNCN | PORTA | PORT_PIN7)
#define PORT_CCL_OUT0_3              (PORT_FUNCN | PORTB | PORT_PIN2)
#define PORT_CCL_OUT0_4              (PORT_FUNCN | PORTB | PORT_PIN23)
#define PORT_CCL_OUT1_1              (PORT_FUNCN | PORTA | PORT_PIN11)
#define PORT_CCL_OUT1_2              (PORT_FUNCN | PORTA | PORT_PIN31)
#define PORT_CCL_OUT1_3              (PORT_FUNCN | PORTB | PORT_PIN11)
#define PORT_CCL_OUT2_1              (PORT_FUNCN | PORTA | PORT_PIN25)
#define PORT_CCL_OUT2_2              (PORT_FUNCN | PORTB | PORT_PIN9)
#define PORT_CCL_OUT3                (PORT_FUNCN | PORTB | PORT_PIN17)

/* Cortex-M4 JTAG/SWD */

#define PORT_CORTEX_CM4_SWCLK        (PORT_FUNCH | PORTA | PORT_PIN30)
#define PORT_CORTEX_CM4_SWDIO        (PORT_FUNCH | PORTA | PORT_PIN31)
#define PORT_CORTEX_CM4_SWO          (PORT_FUNCH | PORTB | PORT_PIN30)
#define PORT_CORTEX_CM4_TRACECLK     (PORT_FUNCH | PORTC | PORT_PIN27)
#define PORT_CORTEX_CM4_TRACEDATA0   (PORT_FUNCH | PORTC | PORT_PIN28)
#define PORT_CORTEX_CM4_TRACEDATA1   (PORT_FUNCH | PORTC | PORT_PIN26)
#define PORT_CORTEX_CM4_TRACEDATA2   (PORT_FUNCH | PORTC | PORT_PIN25)
#define PORT_CORTEX_CM4_TRACEDATA3   (PORT_FUNCH | PORTC | PORT_PIN24)
#define PORT_CORTEX_M4_SWO           (PORT_FUNCM | PORTC | PORT_PIN27)

/* Digital-to-Analog Conversion (DAC) */

#define PORT_DAC_VOUT0               (PORT_FUNCB | PORTA | PORT_PIN2)
#define PORT_DAC_VOUT1               (PORT_FUNCB | PORTA | PORT_PIN5)

/* External Interrupt Controller (EIC) */

#define PORT_EIC_EXTINT0_1           (PORT_FUNCA | PORTA | PORT_PIN0)
#define PORT_EIC_EXTINT0_2           (PORT_FUNCA | PORTA | PORT_PIN16)
#define PORT_EIC_EXTINT0_3           (PORT_FUNCA | PORTB | PORT_PIN0)
#define PORT_EIC_EXTINT0_4           (PORT_FUNCA | PORTB | PORT_PIN16)
#define PORT_EIC_EXTINT0_5           (PORT_FUNCA | PORTC | PORT_PIN0)
#define PORT_EIC_EXTINT0_6           (PORT_FUNCA | PORTC | PORT_PIN16)
#define PORT_EIC_EXTINT0_7           (PORT_FUNCA | PORTD | PORT_PIN0)
#define PORT_EIC_EXTINT1_1           (PORT_FUNCA | PORTA | PORT_PIN1)
#define PORT_EIC_EXTINT1_2           (PORT_FUNCA | PORTA | PORT_PIN17)
#define PORT_EIC_EXTINT1_3           (PORT_FUNCA | PORTB | PORT_PIN1)
#define PORT_EIC_EXTINT1_4           (PORT_FUNCA | PORTB | PORT_PIN17)
#define PORT_EIC_EXTINT1_5           (PORT_FUNCA | PORTC | PORT_PIN1)
#define PORT_EIC_EXTINT1_6           (PORT_FUNCA | PORTC | PORT_PIN17)
#define PORT_EIC_EXTINT1_7           (PORT_FUNCA | PORTD | PORT_PIN1)
#define PORT_EIC_EXTINT2_1           (PORT_FUNCA | PORTA | PORT_PIN18)
#define PORT_EIC_EXTINT2_2           (PORT_FUNCA | PORTA | PORT_PIN2)
#define PORT_EIC_EXTINT2_3           (PORT_FUNCA | PORTB | PORT_PIN18)
#define PORT_EIC_EXTINT2_4           (PORT_FUNCA | PORTB | PORT_PIN2)
#define PORT_EIC_EXTINT2_5           (PORT_FUNCA | PORTC | PORT_PIN18)
#define PORT_EIC_EXTINT2_6           (PORT_FUNCA | PORTC | PORT_PIN2)
#define PORT_EIC_EXTINT3_1           (PORT_FUNCA | PORTA | PORT_PIN19)
#define PORT_EIC_EXTINT3_2           (PORT_FUNCA | PORTA | PORT_PIN3)
#define PORT_EIC_EXTINT3_3           (PORT_FUNCA | PORTB | PORT_PIN19)
#define PORT_EIC_EXTINT3_4           (PORT_FUNCA | PORTB | PORT_PIN3)
#define PORT_EIC_EXTINT3_5           (PORT_FUNCA | PORTC | PORT_PIN19)
#define PORT_EIC_EXTINT3_6           (PORT_FUNCA | PORTC | PORT_PIN3)
#define PORT_EIC_EXTINT3_7           (PORT_FUNCA | PORTD | PORT_PIN8)
#define PORT_EIC_EXTINT4_1           (PORT_FUNCA | PORTA | PORT_PIN20)
#define PORT_EIC_EXTINT4_2           (PORT_FUNCA | PORTA | PORT_PIN4)
#define PORT_EIC_EXTINT4_3           (PORT_FUNCA | PORTB | PORT_PIN20)
#define PORT_EIC_EXTINT4_4           (PORT_FUNCA | PORTB | PORT_PIN4)
#define PORT_EIC_EXTINT4_5           (PORT_FUNCA | PORTC | PORT_PIN20)
#define PORT_EIC_EXTINT4_6           (PORT_FUNCA | PORTC | PORT_PIN4)
#define PORT_EIC_EXTINT4_7           (PORT_FUNCA | PORTD | PORT_PIN9)
#define PORT_EIC_EXTINT5_1           (PORT_FUNCA | PORTA | PORT_PIN21)
#define PORT_EIC_EXTINT5_2           (PORT_FUNCA | PORTA | PORT_PIN5)
#define PORT_EIC_EXTINT5_3           (PORT_FUNCA | PORTB | PORT_PIN21)
#define PORT_EIC_EXTINT5_4           (PORT_FUNCA | PORTB | PORT_PIN5)
#define PORT_EIC_EXTINT5_5           (PORT_FUNCA | PORTC | PORT_PIN21)
#define PORT_EIC_EXTINT5_6           (PORT_FUNCA | PORTC | PORT_PIN5)
#define PORT_EIC_EXTINT5_7           (PORT_FUNCA | PORTD | PORT_PIN10)
#define PORT_EIC_EXTINT6_1           (PORT_FUNCA | PORTA | PORT_PIN22)
#define PORT_EIC_EXTINT6_2           (PORT_FUNCA | PORTA | PORT_PIN6)
#define PORT_EIC_EXTINT6_3           (PORT_FUNCA | PORTB | PORT_PIN22)
#define PORT_EIC_EXTINT6_4           (PORT_FUNCA | PORTB | PORT_PIN6)
#define PORT_EIC_EXTINT6_5           (PORT_FUNCA | PORTC | PORT_PIN22)
#define PORT_EIC_EXTINT6_6           (PORT_FUNCA | PORTC | PORT_PIN6)
#define PORT_EIC_EXTINT6_7           (PORT_FUNCA | PORTD | PORT_PIN11)
#define PORT_EIC_EXTINT7_1           (PORT_FUNCA | PORTA | PORT_PIN23)
#define PORT_EIC_EXTINT7_2           (PORT_FUNCA | PORTA | PORT_PIN7)
#define PORT_EIC_EXTINT7_3           (PORT_FUNCA | PORTB | PORT_PIN23)
#define PORT_EIC_EXTINT7_4           (PORT_FUNCA | PORTB | PORT_PIN7)
#define PORT_EIC_EXTINT7_5           (PORT_FUNCA | PORTC | PORT_PIN23)
#define PORT_EIC_EXTINT7_6           (PORT_FUNCA | PORTD | PORT_PIN12)
#define PORT_EIC_EXTINT8_1           (PORT_FUNCA | PORTA | PORT_PIN24)
#define PORT_EIC_EXTINT8_2           (PORT_FUNCA | PORTB | PORT_PIN24)
#define PORT_EIC_EXTINT8_3           (PORT_FUNCA | PORTB | PORT_PIN8)
#define PORT_EIC_EXTINT8_4           (PORT_FUNCA | PORTC | PORT_PIN24)
#define PORT_EIC_EXTINT9_1           (PORT_FUNCA | PORTA | PORT_PIN25)
#define PORT_EIC_EXTINT9_2           (PORT_FUNCA | PORTA | PORT_PIN9)
#define PORT_EIC_EXTINT9_3           (PORT_FUNCA | PORTB | PORT_PIN25)
#define PORT_EIC_EXTINT9_4           (PORT_FUNCA | PORTB | PORT_PIN9)
#define PORT_EIC_EXTINT9_5           (PORT_FUNCA | PORTC | PORT_PIN25)
#define PORT_EIC_EXTINT9_6           (PORT_FUNCA | PORTC | PORT_PIN7)
#define PORT_EIC_EXTINT10_1          (PORT_FUNCA | PORTA | PORT_PIN10)
#define PORT_EIC_EXTINT10_2          (PORT_FUNCA | PORTB | PORT_PIN10)
#define PORT_EIC_EXTINT10_3          (PORT_FUNCA | PORTC | PORT_PIN10)
#define PORT_EIC_EXTINT10_4          (PORT_FUNCA | PORTC | PORT_PIN26)
#define PORT_EIC_EXTINT10_5          (PORT_FUNCA | PORTD | PORT_PIN20)
#define PORT_EIC_EXTINT11_1          (PORT_FUNCA | PORTA | PORT_PIN11)
#define PORT_EIC_EXTINT11_2          (PORT_FUNCA | PORTA | PORT_PIN27)
#define PORT_EIC_EXTINT11_3          (PORT_FUNCA | PORTB | PORT_PIN11)
#define PORT_EIC_EXTINT11_4          (PORT_FUNCA | PORTC | PORT_PIN11)
#define PORT_EIC_EXTINT11_5          (PORT_FUNCA | PORTC | PORT_PIN27)
#define PORT_EIC_EXTINT11_6          (PORT_FUNCA | PORTD | PORT_PIN21)
#define PORT_EIC_EXTINT12_1          (PORT_FUNCA | PORTA | PORT_PIN12)
#define PORT_EIC_EXTINT12_2          (PORT_FUNCA | PORTB | PORT_PIN12)
#define PORT_EIC_EXTINT12_3          (PORT_FUNCA | PORTB | PORT_PIN26)
#define PORT_EIC_EXTINT12_4          (PORT_FUNCA | PORTC | PORT_PIN12)
#define PORT_EIC_EXTINT12_5          (PORT_FUNCA | PORTC | PORT_PIN28)
#define PORT_EIC_EXTINT13_1          (PORT_FUNCA | PORTA | PORT_PIN13)
#define PORT_EIC_EXTINT13_2          (PORT_FUNCA | PORTB | PORT_PIN13)
#define PORT_EIC_EXTINT13_3          (PORT_FUNCA | PORTB | PORT_PIN27)
#define PORT_EIC_EXTINT13_4          (PORT_FUNCA | PORTC | PORT_PIN13)
#define PORT_EIC_EXTINT14_1          (PORT_FUNCA | PORTA | PORT_PIN14)
#define PORT_EIC_EXTINT14_2          (PORT_FUNCA | PORTA | PORT_PIN30)
#define PORT_EIC_EXTINT14_3          (PORT_FUNCA | PORTB | PORT_PIN14)
#define PORT_EIC_EXTINT14_4          (PORT_FUNCA | PORTB | PORT_PIN28)
#define PORT_EIC_EXTINT14_5          (PORT_FUNCA | PORTB | PORT_PIN30)
#define PORT_EIC_EXTINT14_6          (PORT_FUNCA | PORTC | PORT_PIN14)
#define PORT_EIC_EXTINT14_7          (PORT_FUNCA | PORTC | PORT_PIN30)
#define PORT_EIC_EXTINT15_1          (PORT_FUNCA | PORTA | PORT_PIN15)
#define PORT_EIC_EXTINT15_2          (PORT_FUNCA | PORTA | PORT_PIN31)
#define PORT_EIC_EXTINT15_3          (PORT_FUNCA | PORTB | PORT_PIN15)
#define PORT_EIC_EXTINT15_4          (PORT_FUNCA | PORTB | PORT_PIN29)
#define PORT_EIC_EXTINT15_5          (PORT_FUNCA | PORTB | PORT_PIN31)
#define PORT_EIC_EXTINT15_6          (PORT_FUNCA | PORTC | PORT_PIN15)
#define PORT_EIC_EXTINT15_7          (PORT_FUNCA | PORTC | PORT_PIN31)
#define PORT_EIC_NMI                 (PORT_FUNCA | PORTA | PORT_PIN8)

