apache/nuttx/arch/arm/src/samd5e5/chip/samd5e5_pinmap.h
/* Generic Clock Controller (GCLK) */

#define PORT_GCLK_IO0_1              (PORT_FUNCM | PORTA | PORT_PIN14)
#define PORT_GCLK_IO0_2              (PORT_FUNCM | PORTA | PORT_PIN30)
#define PORT_GCLK_IO0_3              (PORT_FUNCM | PORTB | PORT_PIN14)
#define PORT_GCLK_IO0_4              (PORT_FUNCM | PORTB | PORT_PIN22)
#define PORT_GCLK_IO1_1              (PORT_FUNCL | PORTA | PORT_PIN27)
#define PORT_GCLK_IO1_2              (PORT_FUNCM | PORTA | PORT_PIN15)
#define PORT_GCLK_IO1_3              (PORT_FUNCM | PORTB | PORT_PIN15)
#define PORT_GCLK_IO1_4              (PORT_FUNCM | PORTB | PORT_PIN23)
#define PORT_GCLK_IO2_1              (PORT_FUNCM | PORTA | PORT_PIN16)
#define PORT_GCLK_IO2_2              (PORT_FUNCM | PORTB | PORT_PIN16)
#define PORT_GCLK_IO3_1              (PORT_FUNCM | PORTA | PORT_PIN17)
#define PORT_GCLK_IO3_2              (PORT_FUNCM | PORTB | PORT_PIN17)
#define PORT_GCLK_IO4_1              (PORT_FUNCM | PORTA | PORT_PIN10)
#define PORT_GCLK_IO4_2              (PORT_FUNCM | PORTB | PORT_PIN10)
#define PORT_GCLK_IO4_3              (PORT_FUNCM | PORTB | PORT_PIN18)
#define PORT_GCLK_IO5_1              (PORT_FUNCM | PORTA | PORT_PIN11)
#define PORT_GCLK_IO5_2              (PORT_FUNCM | PORTB | PORT_PIN11)
#define PORT_GCLK_IO5_3              (PORT_FUNCM | PORTB | PORT_PIN19)
#define PORT_GCLK_IO6_1              (PORT_FUNCM | PORTB | PORT_PIN12)
#define PORT_GCLK_IO6_2              (PORT_FUNCM | PORTB | PORT_PIN20)
#define PORT_GCLK_IO7_1              (PORT_FUNCM | PORTB | PORT_PIN13)
#define PORT_GCLK_IO7_2              (PORT_FUNCM | PORTB | PORT_PIN21)

/* Ethernet (GMAC) */

#define PORT_GMAC_GCOL               (PORT_FUNCL | PORTC | PORT_PIN21)
#define PORT_GMAC_GCRS               (PORT_FUNCL | PORTA | PORT_PIN16)
#define PORT_GMAC_GMDC_1             (PORT_FUNCL | PORTA | PORT_PIN20)
#define PORT_GMAC_GMDC_2             (PORT_FUNCL | PORTB | PORT_PIN14)
#define PORT_GMAC_GMDC_3             (PORT_FUNCL | PORTC | PORT_PIN11)
#define PORT_GMAC_GMDC_4             (PORT_FUNCL | PORTC | PORT_PIN22)
#define PORT_GMAC_GMDIO_1            (PORT_FUNCL | PORTA | PORT_PIN21)
#define PORT_GMAC_GMDIO_2            (PORT_FUNCL | PORTB | PORT_PIN15)
#define PORT_GMAC_GMDIO_3            (PORT_FUNCL | PORTC | PORT_PIN12)
#define PORT_GMAC_GMDIO_4            (PORT_FUNCL | PORTC | PORT_PIN23)
#define PORT_GMAC_GRX0               (PORT_FUNCL | PORTA | PORT_PIN13)
#define PORT_GMAC_GRX1               (PORT_FUNCL | PORTA | PORT_PIN12)
#define PORT_GMAC_GRX2               (PORT_FUNCL | PORTC | PORT_PIN15)
#define PORT_GMAC_GRX3               (PORT_FUNCL | PORTC | PORT_PIN14)
#define PORT_GMAC_GRXCK              (PORT_FUNCL | PORTC | PORT_PIN18)
#define PORT_GMAC_GRXDV              (PORT_FUNCL | PORTC | PORT_PIN20)
#define PORT_GMAC_GRXER              (PORT_FUNCL | PORTA | PORT_PIN15)
#define PORT_GMAC_GTX0               (PORT_FUNCL | PORTA | PORT_PIN18)
#define PORT_GMAC_GTX1               (PORT_FUNCL | PORTA | PORT_PIN19)
#define PORT_GMAC_GTX2               (PORT_FUNCL | PORTC | PORT_PIN16)
#define PORT_GMAC_GTX3               (PORT_FUNCL | PORTC | PORT_PIN17)
#define PORT_GMAC_GTXCK              (PORT_FUNCL | PORTA | PORT_PIN14)
#define PORT_GMAC_GTXEN              (PORT_FUNCL | PORTA | PORT_PIN17)
#define PORT_GMAC_GTXER              (PORT_FUNCL | PORTC | PORT_PIN19)

/* Inter IC Sound (I2S) */

#define PORT_I2S_FS0_1               (PORT_FUNCJ | PORTA | PORT_PIN20)
#define PORT_I2S_FS0_2               (PORT_FUNCJ | PORTA | PORT_PIN9)
#define PORT_I2S_FS1_1               (PORT_FUNCJ | PORTA | PORT_PIN23)
#define PORT_I2S_FS1_2               (PORT_FUNCJ | PORTB | PORT_PIN11)
#define PORT_I2S_MCK0_1              (PORT_FUNCJ | PORTA | PORT_PIN8)
#define PORT_I2S_MCK0_2              (PORT_FUNCJ | PORTB | PORT_PIN17)
#define PORT_I2S_MCK1_1              (PORT_FUNCJ | PORTB | PORT_PIN13)
#define PORT_I2S_MCK1_2              (PORT_FUNCJ | PORTB | PORT_PIN29)
#define PORT_I2S_SCK0_1              (PORT_FUNCJ | PORTA | PORT_PIN10)
#define PORT_I2S_SCK0_2              (PORT_FUNCJ | PORTB | PORT_PIN16)
#define PORT_I2S_SCK1_1              (PORT_FUNCJ | PORTB | PORT_PIN12)
#define PORT_I2S_SCK1_2              (PORT_FUNCJ | PORTB | PORT_PIN28)
#define PORT_I2S_SDI_1               (PORT_FUNCJ | PORTA | PORT_PIN22)
#define PORT_I2S_SDI_2               (PORT_FUNCJ | PORTB | PORT_PIN10)
#define PORT_I2S_SDO_1               (PORT_FUNCJ | PORTA | PORT_PIN11)
#define PORT_I2S_SDO_2               (PORT_FUNCJ | PORTA | PORT_PIN21)

/* Parallel Capture Controller (PCC) */

#define PORT_PCC_CLK                 (PORT_FUNCK | PORTA | PORT_PIN14)
#define PORT_PCC_DATA0               (PORT_FUNCK | PORTA | PORT_PIN16)
#define PORT_PCC_DATA1               (PORT_FUNCK | PORTA | PORT_PIN17)
#define PORT_PCC_DATA2               (PORT_FUNCK | PORTA | PORT_PIN18)
#define PORT_PCC_DATA3               (PORT_FUNCK | PORTA | PORT_PIN19)
#define PORT_PCC_DATA4               (PORT_FUNCK | PORTA | PORT_PIN20)
#define PORT_PCC_DATA5               (PORT_FUNCK | PORTA | PORT_PIN21)
#define PORT_PCC_DATA6               (PORT_FUNCK | PORTA | PORT_PIN22)
#define PORT_PCC_DATA7               (PORT_FUNCK | PORTA | PORT_PIN23)
#define PORT_PCC_DATA8               (PORT_FUNCK | PORTB | PORT_PIN14)
#define PORT_PCC_DATA9               (PORT_FUNCK | PORTB | PORT_PIN15)
#define PORT_PCC_DATA10              (PORT_FUNCK | PORTC | PORT_PIN12)
#define PORT_PCC_DATA11              (PORT_FUNCK | PORTC | PORT_PIN13)
#define PORT_PCC_DATA12              (PORT_FUNCK | PORTC | PORT_PIN14)
#define PORT_PCC_DATA13              (PORT_FUNCK | PORTC | PORT_PIN15)
#define PORT_PCC_DEN1                (PORT_FUNCK | PORTA | PORT_PIN12)
#define PORT_PCC_DEN2                (PORT_FUNCK | PORTA | PORT_PIN13)

/* Position Decoder (PDEC) */

#define PORT_PDEC_QDI0_1             (PORT_FUNCG | PORTA | PORT_PIN24)
#define PORT_PDEC_QDI0_2             (PORT_FUNCG | PORTB | PORT_PIN18)
#define PORT_PDEC_QDI0_3             (PORT_FUNCG | PORTB | PORT_PIN23)
#define PORT_PDEC_QDI0_4             (PORT_FUNCG | PORTC | PORT_PIN16)
#define PORT_PDEC_QDI1_1             (PORT_FUNCG | PORTA | PORT_PIN25)
#define PORT_PDEC_QDI1_2             (PORT_FUNCG | PORTB | PORT_PIN19)
#define PORT_PDEC_QDI1_3             (PORT_FUNCG | PORTB | PORT_PIN24)
#define PORT_PDEC_QDI1_4             (PORT_FUNCG | PORTC | PORT_PIN17)
#define PORT_PDEC_QDI2_1             (PORT_FUNCG | PORTB | PORT_PIN20)
#define PORT_PDEC_QDI2_2             (PORT_FUNCG | PORTB | PORT_PIN22)
#define PORT_PDEC_QDI2_3             (PORT_FUNCG | PORTB | PORT_PIN25)
#define PORT_PDEC_QDI2_4             (PORT_FUNCG | PORTC | PORT_PIN18)

/* Peripheral Touch Controller (PTC) */

#define PORT_PTC_X0_Y0               (PORT_FUNCB | PORTA | PORT_PIN3)
#define PORT_PTC_X1_Y1               (PORT_FUNCB | PORTB | PORT_PIN8)
#define PORT_PTC_X2_Y2               (PORT_FUNCB | PORTB | PORT_PIN9)
#define PORT_PTC_X3_Y3               (PORT_FUNCB | PORTA | PORT_PIN4)
#define PORT_PTC_X4_Y4               (PORT_FUNCB | PORTA | PORT_PIN6)
#define PORT_PTC_X5_Y5               (PORT_FUNCB | PORTA | PORT_PIN7)
#define PORT_PTC_X6_Y6               (PORT_FUNCB | PORTA | PORT_PIN8)
#define PORT_PTC_X7_Y7               (PORT_FUNCB | PORTA | PORT_PIN9)
#define PORT_PTC_X8_Y8               (PORT_FUNCB | PORTA | PORT_PIN10)
#define PORT_PTC_X9_Y9               (PORT_FUNCB | PORTA | PORT_PIN11)
#define PORT_PTC_X10_Y10             (PORT_FUNCB | PORTA | PORT_PIN16)
#define PORT_PTC_X11_Y11             (PORT_FUNCB | PORTA | PORT_PIN17)
#define PORT_PTC_X12_Y12             (PORT_FUNCB | PORTA | PORT_PIN18)
#define PORT_PTC_X13_Y13             (PORT_FUNCB | PORTA | PORT_PIN19)
#define PORT_PTC_X14_Y14             (PORT_FUNCB | PORTA | PORT_PIN20)
#define PORT_PTC_X15_Y15             (PORT_FUNCB | PORTA | PORT_PIN21)
#define PORT_PTC_X16_Y16             (PORT_FUNCB | PORTA | PORT_PIN22)
#define PORT_PTC_X17_Y17             (PORT_FUNCB | PORTA | PORT_PIN23)
#define PORT_PTC_X18_Y18             (PORT_FUNCB | PORTA | PORT_PIN27)
#define PORT_PTC_X19_Y19             (PORT_FUNCB | PORTA | PORT_PIN30)
#define PORT_PTC_X20_Y20             (PORT_FUNCB | PORTB | PORT_PIN2)
#define PORT_PTC_X21_Y21             (PORT_FUNCB | PORTB | PORT_PIN3)
#define PORT_PTC_X22_Y22             (PORT_FUNCB | PORTB | PORT_PIN4)
#define PORT_PTC_X23_Y23             (PORT_FUNCB | PORTB | PORT_PIN5)
#define PORT_PTC_X24_Y24             (PORT_FUNCB | PORTB | PORT_PIN6)
#define PORT_PTC_X25_Y25             (PORT_FUNCB | PORTB | PORT_PIN7)
#define PORT_PTC_X26_Y26             (PORT_FUNCB | PORTB | PORT_PIN12)
#define PORT_PTC_X27_Y27             (PORT_FUNCB | PORTB | PORT_PIN13)
#define PORT_PTC_X28_Y28             (PORT_FUNCB | PORTB | PORT_PIN14)
#define PORT_PTC_X29_Y29             (PORT_FUNCB | PORTB | PORT_PIN15)
#define PORT_PTC_X30_Y30             (PORT_FUNCB | PORTB | PORT_PIN0)
#define PORT_PTC_X31_Y31             (PORT_FUNCB | PORTB | PORT_PIN1)

/* Quad SPI (QSPI) */

#define PORT_QSPI_CS                 (PORT_FUNCH | PORTB | PORT_PIN11)
#define PORT_QSPI_DATA0              (PORT_FUNCH | PORTA | PORT_PIN8)
#define PORT_QSPI_DATA1              (PORT_FUNCH | PORTA | PORT_PIN9)
#define PORT_QSPI_DATA2              (PORT_FUNCH | PORTA | PORT_PIN10)
#define PORT_QSPI_DATA3              (PORT_FUNCH | PORTA | PORT_PIN11)
#define PORT_QSPI_SCK                (PORT_FUNCH | PORTB | PORT_PIN10)

/* SDHC Memory Card Controllers */

#define PORT_SDHC0_SDCD_1            (PORT_FUNCI | PORTA | PORT_PIN12)
#define PORT_SDHC0_SDCD_2            (PORT_FUNCI | PORTA | PORT_PIN6)
#define PORT_SDHC0_SDCD_3            (PORT_FUNCI | PORTB | PORT_PIN12)
#define PORT_SDHC0_SDCD_4            (PORT_FUNCI | PORTC | PORT_PIN6)
#define PORT_SDHC0_SDCK              (PORT_FUNCI | PORTB | PORT_PIN11)
#define PORT_SDHC0_SDCMD             (PORT_FUNCI | PORTA | PORT_PIN8)
#define PORT_SDHC0_SDDAT0            (PORT_FUNCI | PORTA | PORT_PIN9)
#define PORT_SDHC0_SDDAT1            (PORT_FUNCI | PORTA | PORT_PIN10)
#define PORT_SDHC0_SDDAT2            (PORT_FUNCI | PORTA | PORT_PIN11)
#define PORT_SDHC0_SDDAT3            (PORT_FUNCI | PORTB | PORT_PIN10)
#define PORT_SDHC0_SDWP_1            (PORT_FUNCI | PORTA | PORT_PIN13)
#define PORT_SDHC0_SDWP_2            (PORT_FUNCI | PORTA | PORT_PIN7)
#define PORT_SDHC0_SDWP_3            (PORT_FUNCI | PORTB | PORT_PIN13)
#define PORT_SDHC0_SDWP_4            (PORT_FUNCI | PORTC | PORT_PIN7)

#define PORT_SDHC1_SDCD_1            (PORT_FUNCI | PORTB | PORT_PIN16)
#define PORT_SDHC1_SDCD_2            (PORT_FUNCI | PORTC | PORT_PIN20)
#define PORT_SDHC1_SDCD_3            (PORT_FUNCI | PORTD | PORT_PIN20)
#define PORT_SDHC1_SDCK              (PORT_FUNCI | PORTA | PORT_PIN21)
#define PORT_SDHC1_SDCMD             (PORT_FUNCI | PORTA | PORT_PIN20)
#define PORT_SDHC1_SDDAT0            (PORT_FUNCI | PORTB | PORT_PIN18)
#define PORT_SDHC1_SDDAT1            (PORT_FUNCI | PORTB | PORT_PIN19)
#define PORT_SDHC1_SDDAT2            (PORT_FUNCI | PORTB | PORT_PIN20)
#define PORT_SDHC1_SDDAT3            (PORT_FUNCI | PORTB | PORT_PIN21)
#define PORT_SDHC1_SDWP_1            (PORT_FUNCI | PORTB | PORT_PIN17)
#define PORT_SDHC1_SDWP_2            (PORT_FUNCI | PORTC | PORT_PIN21)
#define PORT_SDHC1_SDWP_3            (PORT_FUNCI | PORTD | PORT_PIN21)

