apache/nuttx/arch/arm/src/samd5e5/chip/samd5e5_pinmap.h
#define PORT_TC4_WO0_1               (PORT_FUNCE | PORTA | PORT_PIN22)
#define PORT_TC4_WO0_2               (PORT_FUNCE | PORTB | PORT_PIN12)
#define PORT_TC4_WO0_3               (PORT_FUNCE | PORTB | PORT_PIN8)
#define PORT_TC4_WO1_1               (PORT_FUNCE | PORTA | PORT_PIN23)
#define PORT_TC4_WO1_2               (PORT_FUNCE | PORTB | PORT_PIN13)
#define PORT_TC4_WO1_3               (PORT_FUNCE | PORTB | PORT_PIN9)

#define PORT_TC5_WO0_1               (PORT_FUNCE | PORTA | PORT_PIN24)
#define PORT_TC5_WO0_2               (PORT_FUNCE | PORTB | PORT_PIN10)
#define PORT_TC5_WO0_3               (PORT_FUNCE | PORTB | PORT_PIN14)
#define PORT_TC5_WO1_1               (PORT_FUNCE | PORTA | PORT_PIN25)
#define PORT_TC5_WO1_2               (PORT_FUNCE | PORTB | PORT_PIN11)
#define PORT_TC5_WO1_3               (PORT_FUNCE | PORTB | PORT_PIN15)

#define PORT_TC6_WO0_1               (PORT_FUNCE | PORTA | PORT_PIN30)
#define PORT_TC6_WO0_2               (PORT_FUNCE | PORTB | PORT_PIN16)
#define PORT_TC6_WO0_3               (PORT_FUNCE | PORTB | PORT_PIN2)
#define PORT_TC6_WO1_1               (PORT_FUNCE | PORTA | PORT_PIN31)
#define PORT_TC6_WO1_2               (PORT_FUNCE | PORTB | PORT_PIN17)
#define PORT_TC6_WO1_3               (PORT_FUNCE | PORTB | PORT_PIN3)

#define PORT_TC7_WO0_1               (PORT_FUNCE | PORTA | PORT_PIN20)
#define PORT_TC7_WO0_2               (PORT_FUNCE | PORTB | PORT_PIN0)
#define PORT_TC7_WO0_3               (PORT_FUNCE | PORTB | PORT_PIN22)
#define PORT_TC7_WO1_1               (PORT_FUNCE | PORTA | PORT_PIN21)
#define PORT_TC7_WO1_2               (PORT_FUNCE | PORTB | PORT_PIN1)
#define PORT_TC7_WO1_3               (PORT_FUNCE | PORTB | PORT_PIN23)

/* Timer/Counters Control (TCC) */

#define PORT_TCC0_WO0_1              (PORT_FUNCF | PORTA | PORT_PIN8)
#define PORT_TCC0_WO0_2              (PORT_FUNCF | PORTC | PORT_PIN10)
#define PORT_TCC0_WO0_3              (PORT_FUNCF | PORTC | PORT_PIN16)
#define PORT_TCC0_WO0_4              (PORT_FUNCF | PORTC | PORT_PIN4)
#define PORT_TCC0_WO0_5              (PORT_FUNCG | PORTA | PORT_PIN20)
#define PORT_TCC0_WO0_6              (PORT_FUNCG | PORTB | PORT_PIN12)
#define PORT_TCC0_WO1_1              (PORT_FUNCF | PORTA | PORT_PIN9)
#define PORT_TCC0_WO1_2              (PORT_FUNCF | PORTC | PORT_PIN11)
#define PORT_TCC0_WO1_3              (PORT_FUNCF | PORTC | PORT_PIN17)
#define PORT_TCC0_WO1_4              (PORT_FUNCF | PORTD | PORT_PIN8)
#define PORT_TCC0_WO1_5              (PORT_FUNCG | PORTA | PORT_PIN21)
#define PORT_TCC0_WO1_6              (PORT_FUNCG | PORTB | PORT_PIN13)
#define PORT_TCC0_WO2_1              (PORT_FUNCF | PORTA | PORT_PIN10)
#define PORT_TCC0_WO2_2              (PORT_FUNCF | PORTC | PORT_PIN12)
#define PORT_TCC0_WO2_3              (PORT_FUNCF | PORTC | PORT_PIN18)
#define PORT_TCC0_WO2_4              (PORT_FUNCF | PORTD | PORT_PIN9)
#define PORT_TCC0_WO2_5              (PORT_FUNCG | PORTA | PORT_PIN22)
#define PORT_TCC0_WO2_6              (PORT_FUNCG | PORTB | PORT_PIN14)
#define PORT_TCC0_WO3_1              (PORT_FUNCF | PORTA | PORT_PIN11)
#define PORT_TCC0_WO3_2              (PORT_FUNCF | PORTC | PORT_PIN13)
#define PORT_TCC0_WO3_3              (PORT_FUNCF | PORTC | PORT_PIN19)
#define PORT_TCC0_WO3_4              (PORT_FUNCF | PORTD | PORT_PIN10)
#define PORT_TCC0_WO3_5              (PORT_FUNCG | PORTA | PORT_PIN23)
#define PORT_TCC0_WO3_6              (PORT_FUNCG | PORTB | PORT_PIN15)
#define PORT_TCC0_WO4_1              (PORT_FUNCF | PORTB | PORT_PIN10)
#define PORT_TCC0_WO4_2              (PORT_FUNCF | PORTC | PORT_PIN14)
#define PORT_TCC0_WO4_3              (PORT_FUNCF | PORTC | PORT_PIN20)
#define PORT_TCC0_WO4_4              (PORT_FUNCF | PORTD | PORT_PIN11)
#define PORT_TCC0_WO4_5              (PORT_FUNCG | PORTA | PORT_PIN16)
#define PORT_TCC0_WO4_6              (PORT_FUNCG | PORTB | PORT_PIN16)
#define PORT_TCC0_WO5_1              (PORT_FUNCF | PORTB | PORT_PIN11)
#define PORT_TCC0_WO5_2              (PORT_FUNCF | PORTC | PORT_PIN15)
#define PORT_TCC0_WO5_3              (PORT_FUNCF | PORTC | PORT_PIN21)
#define PORT_TCC0_WO5_4              (PORT_FUNCF | PORTD | PORT_PIN12)
#define PORT_TCC0_WO5_5              (PORT_FUNCG | PORTA | PORT_PIN17)
#define PORT_TCC0_WO5_6              (PORT_FUNCG | PORTB | PORT_PIN17)
#define PORT_TCC0_WO6_1              (PORT_FUNCF | PORTA | PORT_PIN12)
#define PORT_TCC0_WO6_2              (PORT_FUNCF | PORTC | PORT_PIN22)
#define PORT_TCC0_WO6_3              (PORT_FUNCG | PORTA | PORT_PIN18)
#define PORT_TCC0_WO6_4              (PORT_FUNCG | PORTB | PORT_PIN30)
#define PORT_TCC0_WO7_1              (PORT_FUNCF | PORTA | PORT_PIN13)
#define PORT_TCC0_WO7_2              (PORT_FUNCF | PORTC | PORT_PIN23)
#define PORT_TCC0_WO7_3              (PORT_FUNCG | PORTA | PORT_PIN19)
#define PORT_TCC0_WO7_4              (PORT_FUNCG | PORTB | PORT_PIN31)

#define PORT_TCC1_WO0_1              (PORT_FUNCF | PORTA | PORT_PIN16)
#define PORT_TCC1_WO0_2              (PORT_FUNCF | PORTB | PORT_PIN18)
#define PORT_TCC1_WO0_3              (PORT_FUNCF | PORTD | PORT_PIN20)
#define PORT_TCC1_WO0_4              (PORT_FUNCG | PORTB | PORT_PIN10)
#define PORT_TCC1_WO0_5              (PORT_FUNCG | PORTC | PORT_PIN14)
#define PORT_TCC1_WO1_1              (PORT_FUNCF | PORTA | PORT_PIN17)
#define PORT_TCC1_WO1_2              (PORT_FUNCF | PORTB | PORT_PIN19)
#define PORT_TCC1_WO1_3              (PORT_FUNCF | PORTD | PORT_PIN21)
#define PORT_TCC1_WO1_4              (PORT_FUNCG | PORTB | PORT_PIN11)
#define PORT_TCC1_WO1_5              (PORT_FUNCG | PORTC | PORT_PIN15)
#define PORT_TCC1_WO2_1              (PORT_FUNCF | PORTA | PORT_PIN18)
#define PORT_TCC1_WO2_2              (PORT_FUNCF | PORTB | PORT_PIN20)
#define PORT_TCC1_WO2_3              (PORT_FUNCF | PORTB | PORT_PIN26)
#define PORT_TCC1_WO2_4              (PORT_FUNCG | PORTA | PORT_PIN12)
#define PORT_TCC1_WO2_5              (PORT_FUNCG | PORTA | PORT_PIN14)
#define PORT_TCC1_WO3_1              (PORT_FUNCF | PORTA | PORT_PIN19)
#define PORT_TCC1_WO3_2              (PORT_FUNCF | PORTB | PORT_PIN21)
#define PORT_TCC1_WO3_3              (PORT_FUNCF | PORTB | PORT_PIN27)
#define PORT_TCC1_WO3_4              (PORT_FUNCG | PORTA | PORT_PIN13)
#define PORT_TCC1_WO3_5              (PORT_FUNCG | PORTA | PORT_PIN15)
#define PORT_TCC1_WO4_1              (PORT_FUNCF | PORTA | PORT_PIN20)
#define PORT_TCC1_WO4_2              (PORT_FUNCF | PORTB | PORT_PIN28)
#define PORT_TCC1_WO4_3              (PORT_FUNCG | PORTA | PORT_PIN8)
#define PORT_TCC1_WO4_4              (PORT_FUNCG | PORTC | PORT_PIN10)
#define PORT_TCC1_WO5_1              (PORT_FUNCF | PORTA | PORT_PIN21)
#define PORT_TCC1_WO5_2              (PORT_FUNCF | PORTB | PORT_PIN29)
#define PORT_TCC1_WO5_3              (PORT_FUNCG | PORTA | PORT_PIN9)
#define PORT_TCC1_WO5_4              (PORT_FUNCG | PORTC | PORT_PIN11)
#define PORT_TCC1_WO6_1              (PORT_FUNCF | PORTA | PORT_PIN22)
#define PORT_TCC1_WO6_2              (PORT_FUNCG | PORTA | PORT_PIN10)
#define PORT_TCC1_WO6_3              (PORT_FUNCG | PORTC | PORT_PIN12)
#define PORT_TCC1_WO7_1              (PORT_FUNCF | PORTA | PORT_PIN23)
#define PORT_TCC1_WO7_2              (PORT_FUNCG | PORTA | PORT_PIN11)
#define PORT_TCC1_WO7_3              (PORT_FUNCG | PORTC | PORT_PIN13)

#define PORT_TCC2_WO0_1              (PORT_FUNCF | PORTA | PORT_PIN14)
#define PORT_TCC2_WO0_2              (PORT_FUNCF | PORTA | PORT_PIN30)
#define PORT_TCC2_WO1_1              (PORT_FUNCF | PORTA | PORT_PIN15)
#define PORT_TCC2_WO1_2              (PORT_FUNCF | PORTA | PORT_PIN31)
#define PORT_TCC2_WO2_1              (PORT_FUNCF | PORTA | PORT_PIN24)
#define PORT_TCC2_WO2_2              (PORT_FUNCF | PORTB | PORT_PIN2)

#define PORT_TCC3_WO0_1              (PORT_FUNCF | PORTB | PORT_PIN12)
#define PORT_TCC3_WO0_2              (PORT_FUNCF | PORTB | PORT_PIN16)
#define PORT_TCC3_WO1_1              (PORT_FUNCF | PORTB | PORT_PIN13)
#define PORT_TCC3_WO1_2              (PORT_FUNCF | PORTB | PORT_PIN17)

#define PORT_TCC4_WO0_1              (PORT_FUNCF | PORTB | PORT_PIN14)
#define PORT_TCC4_WO0_2              (PORT_FUNCF | PORTB | PORT_PIN30)
#define PORT_TCC4_WO1_1              (PORT_FUNCF | PORTB | PORT_PIN15)
#define PORT_TCC4_WO1_2              (PORT_FUNCF | PORTB | PORT_PIN31)

/* USB */

#define PORT_USB_DM                  (PORT_FUNCH | PORTA | PORT_PIN24)
#define PORT_USB_DP                  (PORT_FUNCH | PORTA | PORT_PIN25)
#define PORT_USB_SOF_1KHZ_1          (PORT_FUNCH | PORTA | PORT_PIN23)
#define PORT_USB_SOF_1KHZ_2          (PORT_FUNCH | PORTB | PORT_PIN22)

/********************************************************************************************
 * Public Types
 ********************************************************************************************/

/********************************************************************************************
 * Public Data
 ********************************************************************************************/

/********************************************************************************************
 * Public Functions
 ********************************************************************************************/

#endif /* __ARCH_ARM_SRC_SAMD5E5_CHIP_SAM_PINMAP_H */
